IDENTIFICATION DIVISION.
PROGRAM-ID. CLAIMENGINE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 CLAIM-ID        PIC 9(6)    VALUE 500001.
01 CLAIM-AMOUNT    PIC 9(7)V99 VALUE 1500.50.
01 CLAIM-STATUS    PIC X(10)   VALUE "PENDING".

PROCEDURE DIVISION.
    DISPLAY "CLAIM ENGINE START".

    DISPLAY "CLAIM ID  : " CLAIM-ID.
    DISPLAY "AMOUNT    : " CLAIM-AMOUNT.
    DISPLAY "STATUS    : " CLAIM-STATUS.

    DISPLAY "BUILD SUCCESSFUL".
    GOBACK.