IDENTIFICATION DIVISION.
       PROGRAM-ID. CLAIMENGINE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       EXEC SQL BEGIN DECLARE SECTION END-EXEC.
       01 DB-CLAIM-ID      PIC 9(6).
       EXEC SQL END DECLARE SECTION END-EXEC.

       PROCEDURE DIVISION.
           DISPLAY "CLAIM ENGINE: PROCESSING...".
           GOBACK.