IDENTIFICATION DIVISION.
       PROGRAM-ID. CLAIMENGINE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       EXEC SQL BEGIN DECLARE SECTION END-EXEC.
       01 DB-CLAIM-ID      PIC 9(6).
       EXEC SQL END DECLARE SECTION END-EXEC.
       01 SQLCODE          PIC S9(9) COMP VALUE 0.

       PROCEDURE DIVISION.
           DISPLAY "CLAIM ENGINE: PROCESSING...".
           GOBACK.