IDENTIFICATION DIVISION.
       PROGRAM-ID. POLICYENGINE.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       EXEC SQL BEGIN DECLARE SECTION END-EXEC.
       01 DB-POLICY-ID     PIC 9(6).
       EXEC SQL END DECLARE SECTION END-EXEC.

       PROCEDURE DIVISION.
           DISPLAY "POLICY ENGINE: UPDATING STATUS".
           EXEC SQL
               UPDATE policy SET status = 'ACTIVE' 
               WHERE policy_id = :DB-POLICY-ID
           END-EXEC.
           GOBACK.