IDENTIFICATION DIVISION.
PROGRAM-ID. POLICYENGINE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 POLICY-ID       PIC 9(6)  VALUE 100001.
01 CUSTOMER-NAME   PIC X(30) VALUE "JOHN DOE".
01 STATUS          PIC X(10) VALUE "ACTIVE".

PROCEDURE DIVISION.
    DISPLAY "POLICY ENGINE START".

    DISPLAY "POLICY ID: " POLICY-ID.
    DISPLAY "CUSTOMER : " CUSTOMER-NAME.
    DISPLAY "STATUS   : " STATUS.

    DISPLAY "BUILD SUCCESSFUL".
    GOBACK.