       IDENTIFICATION DIVISION.
       PROGRAM-ID. RATINGENGINE.

       DATA DIVISION.
       LINKAGE SECTION.

       01 L-BASE-PREMIUM    PIC 9(7)V99.
       01 L-RIDER-PREMIUM   PIC 9(7)V99.
       01 L-TOTAL-PREMIUM   PIC 9(7)V99.

       PROCEDURE DIVISION USING
            L-BASE-PREMIUM
            L-RIDER-PREMIUM
            L-TOTAL-PREMIUM.

           DISPLAY "RATING ENGINE START"

      * Calculate premium

           COMPUTE L-TOTAL-PREMIUM =
                L-BASE-PREMIUM + L-RIDER-PREMIUM

           DISPLAY "BASE PREMIUM : " L-BASE-PREMIUM
           DISPLAY "RIDER PREMIUM: " L-RIDER-PREMIUM
           DISPLAY "TOTAL PREMIUM: " L-TOTAL-PREMIUM

           DISPLAY "RATING ENGINE FINISHED"

           GOBACK.