IDENTIFICATION DIVISION.
PROGRAM-ID. TESTSQL.

DATA DIVISION.
WORKING-STORAGE SECTION.
EXEC SQL BEGIN DECLARE SECTION END-EXEC.
01 DB-ID            PIC 9(03).
01 DB-NAME          PIC X(20).
EXEC SQL END DECLARE SECTION END-EXEC.

PROCEDURE DIVISION.
    DISPLAY "BUILD SUCCESSFUL".
    GOBACK.