IDENTIFICATION DIVISION.
PROGRAM-ID. RATINGENGINE.

ENVIRONMENT DIVISION.
 
DATA DIVISION.
WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
    DISPLAY "BUILD SUCCESSFUL".
    GOBACK.