IDENTIFICATION DIVISION.
PROGRAM-ID. TESTSQL.
 
ENVIRONMENT DIVISION.
 
DATA DIVISION.
WORKING-STORAGE SECTION.
EXEC SQL BEGIN DECLARE SECTION END-EXEC.
01 DB-ID            PIC 9(03).
01 DB-NAME          PIC X(20).
EXEC SQL END DECLARE SECTION END-EXEC.
01 SQLCODE          PIC S9(9) COMP VALUE 0.
PROCEDURE DIVISION.
    DISPLAY "BUILD SUCCESSFUL".
    GOBACK.